LESSON501/LESSON501/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

LESSON501/LESSON501/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Расходная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

LESSON501/LESSON501/src/Documents/ПриходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Взаиморасчеты Расход
	
	Движения.Взаиморасчеты.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрНакопления.Взаиморасчеты");
	Элемент.УстановитьЗначение("Контрагент",Контрагент);
	Элемент.Режим=РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Валюта,
	|	ВзаиморасчетыОстатки.Расходная,
	|	ВзаиморасчетыОстатки.СуммаВалОстаток,
	|	ВзаиморасчетыОстатки.СуммаРубОстаток
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
	|ГДЕ
	|	(ВзаиморасчетыОстатки.СуммаВалОстаток > 0)
	|		
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Валюта,
	|	вт.Расходная,
	|	вт.СуммаВалОстаток,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&МоментВремени,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						вт.Валюта
	|					ИЗ
	|						вт КАК вт)) КАК КурсыВалютСрезПоследних
	|		ПО вт.Валюта = КурсыВалютСрезПоследних.Валюта";
	
	Запрос.УстановитьПараметр("МоментВремени",МоментВремени());
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	
	ОсталосьСписать = СуммаРуб;
	
	выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() и ОсталосьСписать<>0  Цикл
		
		СуммаСписанияРуб = МИН(выборка.СуммаВалОстаток * выборка.Курс, ОсталосьСписать);
				
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Валюта = выборка.Валюта;
		Движение.Расходная = выборка.Расходная;
		Движение.СуммаВал = СуммаСписанияРуб/выборка.Курс;
	
		ОсталосьСписать = ОсталосьСписать - СуммаСписанияРуб;
		
	КонецЦикла;	
	
	Если  ОсталосьСписать <> 0 Тогда
		
		 Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Валюта = Справочники.Валюты.НайтиПоКоду(810);
		Движение.СуммаВал = ОсталосьСписать;
	

	КонецЕсли;	
	
	
	Движения.Взаиморасчеты.записывать = Истина;

	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
